ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_sent_mtpg_regs.xml
<module id="SENT_MTPG" HW_revision="" description="SENT MTPG Registers">
	<register id="BC_MTP_EN" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="MTP_EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP1" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP2" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP3" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP4" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP5" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP6" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP7" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP8" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_CMP9" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_MTP_PERIOD" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="PERIOD" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="BC_TRIGSEL" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="TRIGSEL" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="BC_MTP_SWTR" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="SWTR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="S1_MTP_EN" width="32" page="0" offset="256" internal="0" description="">
		<bitfield id="MTP_EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP1" width="32" page="0" offset="260" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP2" width="32" page="0" offset="264" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP3" width="32" page="0" offset="268" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP4" width="32" page="0" offset="272" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP5" width="32" page="0" offset="276" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP6" width="32" page="0" offset="280" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP7" width="32" page="0" offset="284" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP8" width="32" page="0" offset="288" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP9" width="32" page="0" offset="292" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_CMP10RE" width="32" page="0" offset="296" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_PERIOD" width="32" page="0" offset="300" internal="0" description="">
		<bitfield id="PERIOD" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S1_MTP_TO" width="32" page="0" offset="304" internal="0" description="">
		<bitfield id="TIMEOUT" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S1_TRIGSEL" width="32" page="0" offset="308" internal="0" description="">
		<bitfield id="TRIGSEL" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="S1_MTP_SWTR" width="32" page="0" offset="312" internal="0" description="">
		<bitfield id="SWTR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="S2_MTP_EN" width="32" page="0" offset="512" internal="0" description="">
		<bitfield id="MTP_EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP1" width="32" page="0" offset="516" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP2" width="32" page="0" offset="520" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP3" width="32" page="0" offset="524" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP4" width="32" page="0" offset="528" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP5" width="32" page="0" offset="532" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP6" width="32" page="0" offset="536" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP7" width="32" page="0" offset="540" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP8" width="32" page="0" offset="544" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP9" width="32" page="0" offset="548" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_CMP10RE" width="32" page="0" offset="552" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_PERIOD" width="32" page="0" offset="556" internal="0" description="">
		<bitfield id="PERIOD" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S2_MTP_TO" width="32" page="0" offset="560" internal="0" description="">
		<bitfield id="TIMEOUT" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S2_TRIGSEL" width="32" page="0" offset="564" internal="0" description="">
		<bitfield id="TRIGSEL" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="S2_MTP_SWTR" width="32" page="0" offset="568" internal="0" description="">
		<bitfield id="SWTR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="S3_MTP_EN" width="32" page="0" offset="768" internal="0" description="">
		<bitfield id="MTP_EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP1" width="32" page="0" offset="772" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP2" width="32" page="0" offset="776" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP3" width="32" page="0" offset="780" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP4" width="32" page="0" offset="784" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP5" width="32" page="0" offset="788" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP6" width="32" page="0" offset="792" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP7" width="32" page="0" offset="796" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP8" width="32" page="0" offset="800" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP9" width="32" page="0" offset="804" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_CMP10RE" width="32" page="0" offset="808" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_PERIOD" width="32" page="0" offset="812" internal="0" description="">
		<bitfield id="PERIOD" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S3_MTP_TO" width="32" page="0" offset="816" internal="0" description="">
		<bitfield id="TIMEOUT" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S3_TRIGSEL" width="32" page="0" offset="820" internal="0" description="">
		<bitfield id="TRIGSEL" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="S3_MTP_SWTR" width="32" page="0" offset="824" internal="0" description="">
		<bitfield id="SWTR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="S4_MTP_EN" width="32" page="0" offset="1024" internal="0" description="">
		<bitfield id="MTP_EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP1" width="32" page="0" offset="1028" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP2" width="32" page="0" offset="1032" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP3" width="32" page="0" offset="1036" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP4" width="32" page="0" offset="1040" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP5" width="32" page="0" offset="1044" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP6" width="32" page="0" offset="1048" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP7" width="32" page="0" offset="1052" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP8" width="32" page="0" offset="1056" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP9" width="32" page="0" offset="1060" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_CMP10RE" width="32" page="0" offset="1064" internal="0" description="">
		<bitfield id="TOGGLETIME" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_PERIOD" width="32" page="0" offset="1068" internal="0" description="">
		<bitfield id="PERIOD" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="11" width="21" rwaccess="R"/>
	</register>
	<register id="S4_MTP_TO" width="32" page="0" offset="1072" internal="0" description="">
		<bitfield id="TIMEOUT" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S4_TRIGSEL" width="32" page="0" offset="1076" internal="0" description="">
		<bitfield id="TRIGSEL" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="S4_MTP_SWTR" width="32" page="0" offset="1080" internal="0" description="">
		<bitfield id="SWTR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="WAITTIME" width="32" page="0" offset="1792" internal="0" description="">
		<bitfield id="WAITTIME" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="TPGENSTAT" width="32" page="0" offset="1796" internal="0" description="">
		<bitfield id="ACTIVE_CH" description="" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="SWTSTAT" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TRIG_REQ" description="" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="6" end="5" width="2" rwaccess="R"/>
		<bitfield id="RSVD_1" description="" begin="31" end="13" width="19" rwaccess="R"/>
	</register>
	<register id="MTP_VERSION" width="32" page="0" offset="1840" internal="0" description="">
		<bitfield id="VERSION" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MTP_SWR" width="32" page="0" offset="1852" internal="0" description="">
		<bitfield id="SWR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
</module>
